Revit 2024 API
MEPCurveType.Cross Property
The default cross fitting of the MEP curve type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilySymbol Cross { get; set; }
Visual Basic
Public Property Cross As FamilySymbol
	Get
	Set
Visual C++
public:
property FamilySymbol^ Cross {
	FamilySymbol^ get ();
	void set (FamilySymbol^ value);
}
Remarks
This property is used to retrieve the default cross fitting of the MEP curve type, and can be null if there is no default value. Use RoutingPreferenceManager to set this property for PipeType MEPCurves.
See Also
MEPCurveType Class
Autodesk.Revit.DB Namespace